//-----------------------------------------------------------------------------
//功能说明：风暖面板，显示数据更新
//创建日期：
//-----------------------------------------------------------------------------
#include <intrins.h>
#include "ca51f_config.h"
#include "ca51f2sfr.h"
#include "ca51f2xsfr.h"
#include "gpiodef_f2.h"
#include "system.h"

//-----------------------------------------------------------------------------
#include "flash.h"
#include "WT588Fxx.h"

#include "LCD_DRIVER.H"
#include "RTC_DRVIER.H"
#include "KeyEvent.H"
#include "UART2_ISR.h"
#include "HP_03N_DRV.H"
#include "DisplayUpdata.H"

#ifdef Enable_CMT2300	//打开双向遥控
	#include "Radio.H"
#endif

#include "RF_Receiver.H"
//---- 笔段排列顺序 --- 0 -- 7 == C G B   D E F A
//-----------------------------------0----1----2----3----4----5----6----7----8----9-----------
unsigned char code LCD_NUM_CODE[]={0xF5,0x05,0xB6,0x97,0x47,0xD3,0xF3,0x85,0xF7,0xD7,\
//-----------------------------------H----F----o----N----O----C----P----U----E--  -  ---------
								   0x67,0xE2,0x33,0xE5,0xC6,0xF0,0xE6,0x75,0xF2,0x02,\
//-----------------------------------A ---L---
								   0xE7,0x70};
//-----------------------------------------------------------------------------
xdata unsigned int BackLightTime;
xdata unsigned char DisplayIndex;
xdata unsigned char DisplaySetIndex;
xdata unsigned char DisplayStateIndex;
xdata unsigned char FlashDisplayTime;
/////
xdata unsigned char Fan_DisplayTime;
xdata unsigned char Fan_DisplayHold;

xdata unsigned char Fan_DisplayIndex;
//////
xdata unsigned char SystemRunIndex;
xdata unsigned char SystemRunState;
//////
xdata unsigned char SystemStateTime;
xdata unsigned char SystemStateHold;
////////////////////////////////////////////////////////////////
#define MainPassword  0x9009//超级密码
xdata unsigned int InputPassword;

//////
xdata union{
	unsigned char Array[2];
	unsigned int Data;
}RunVoltage;
////////////////////////////////////////////////////////////////
xdata union{
	unsigned char TempArray[2];
	signed int Temperature;
}SW;
xdata union{
	unsigned char TempArray[2];
	signed int Temperature;
}HY;
xdata union{
	unsigned char Array[2];
	unsigned int Data;
}RotateSpeed;
xdata union{
	unsigned char Array[2];
	unsigned int Data;
}Set_Speed;
xdata union{
    unsigned char Array[2];
	unsigned int Data;
}Fan_Vot;
xdata union{
    unsigned int DutyCycle;
    unsigned char Data[2];
}Ignition_Vot;
xdata union{
    unsigned int Current;
    unsigned char Data[2];
}Ignition_CUR;

xdata union{
    unsigned char Array[2];
	unsigned int Data;
}WaterPump_CUR;
xdata unsigned char ErrorIndex;
xdata unsigned char ErrorIndexHold;
xdata unsigned char SetupTemperatureHold;

xdata unsigned char OilpumpSetFrequ;//油泵设定频率
xdata unsigned char OilPumpFrequency;//油泵频率
xdata unsigned char WorkingTime;//剩余工作时间
xdata unsigned char RemainingWorkingTime;//剩余工作时间
//-----------------------------------------------------------------------------
xdata union{
	unsigned char DATA;
	struct{
		unsigned char BIT_1:1;//喇叭 图标
		unsigned char BIT_2:1;//海拔高度 m
		unsigned char BIT_3:1;//加热图标
		unsigned char BIT_4:1;//故障图标
		unsigned char BIT_5:1;//油箱图标
		unsigned char BIT_6:1;//转速 RPM
		unsigned char BIT_7:1;//电压单位 V
		unsigned char BIT_8:1;//百分比 %
	}BIT;
}LCD_00;//第一行，第一个8字
xdata union{
	unsigned char DATA;
	struct{
		unsigned char BIT_1:1;//1C
		unsigned char BIT_2:1;//1G
		unsigned char BIT_3:1;//1B
		unsigned char BIT_4:1;//Hz
		unsigned char BIT_5:1;//1D
		unsigned char BIT_6:1;//1E
		unsigned char BIT_7:1;//1F
		unsigned char BIT_8:1;//1A
	}BIT;
}LCD_01;//第二行，第二个8字
xdata union{
	unsigned char DATA;
	struct{
		unsigned char BIT_1:1;//2C
		unsigned char BIT_2:1;//2G
		unsigned char BIT_3:1;//2B
		unsigned char BIT_4:1;//第3位 下点
		unsigned char BIT_5:1;//2D
		unsigned char BIT_6:1;//2E
		unsigned char BIT_7:1;//2F
		unsigned char BIT_8:1;//2A
	}BIT;
}LCD_02;//第二行，第二个8字
xdata union{
	unsigned char DATA;
	struct{
		unsigned char BIT_1:1;//第2位 下点
		unsigned char BIT_2:1;//秒点
		unsigned char BIT_3:1;//电池图标
		unsigned char BIT_4:1;//第3位 上点
		unsigned char BIT_5:1;//飘带 10		电源-右下角
		unsigned char BIT_6:1;//飘带 9 
		unsigned char BIT_7:1;//飘带 8
		unsigned char BIT_8:1;//飘带 7
	}BIT;
}LCD_03;//第二行，第一个8字
xdata union{
	unsigned char DATA;
	struct{
		unsigned char BIT_1:1;//飘带 3		箭头-右下角
		unsigned char BIT_2:1;//飘带 4		
		unsigned char BIT_3:1;//飘带 5
		unsigned char BIT_4:1;//飘带 6
		unsigned char BIT_5:1;//关机 图标
		unsigned char BIT_6:1;//飘带 2
		unsigned char BIT_7:1;//飘带 线条
		unsigned char BIT_8:1;//飘带 1
	}BIT;
}LCD_04;//第三行，第一个8字
xdata union{
	unsigned char DATA;
	struct{
		unsigned char BIT_1:1;//下调 图标
		unsigned char BIT_2:1;//闹钟图标
		unsigned char BIT_3:1;//AT 图标
		unsigned char BIT_4:1;//MT 图标
		unsigned char BIT_5:1;//上调 图标
		unsigned char BIT_6:1;//断线 图标
		unsigned char BIT_7:1;//温度传感器 图标
		unsigned char BIT_8:1;//点火塞 图标
	}BIT;
}LCD_05;//第四行，第二个8字
xdata union{
	unsigned char DATA;
	struct{
		unsigned char BIT_1:1;//扇叶 1
		unsigned char BIT_2:1;//扇叶 中点
		unsigned char BIT_3:1;//扇叶 2
		unsigned char BIT_4:1;//设置 图标
		unsigned char BIT_5:1;//油泵 图标
		unsigned char BIT_6:1;//水泵 图标
		unsigned char BIT_7:1;//扇叶 4
		unsigned char BIT_8:1;//扇叶 3
	}BIT;
}LCD_06;//第四行，第一个8字
xdata union{
	unsigned char DATA;
	struct{
		unsigned char BIT_1:1;//天线 主线
		unsigned char BIT_2:1;//天线 1
		unsigned char BIT_3:1;//天线 2
		unsigned char BIT_4:1;//天线 3
		unsigned char BIT_5:1;//4D
		unsigned char BIT_6:1;//4E
		unsigned char BIT_7:1;//4F
		unsigned char BIT_8:1;//4A
	}BIT;
}LCD_07;//第五行，第一个8字
xdata union{
	unsigned char DATA;
	struct{
		unsigned char BIT_1:1;//4C
		unsigned char BIT_2:1;//4G
		unsigned char BIT_3:1;//4B
		unsigned char BIT_4:1;//天线 4
		unsigned char BIT_5:1;//3D
		unsigned char BIT_6:1;//3E
		unsigned char BIT_7:1;//3F
		unsigned char BIT_8:1;//3A
	}BIT;
}LCD_08;//第五行，第一个8字
xdata union{
	unsigned char DATA;
	struct{
		unsigned char BIT_1:1;//3C
		unsigned char BIT_2:1;//3G
		unsigned char BIT_3:1;//3B
		unsigned char BIT_4:1;//海拔高度 图标
		unsigned char BIT_5:1;//
		unsigned char BIT_6:1;//
		unsigned char BIT_7:1;//
		unsigned char BIT_8:1;//
	}BIT;
}LCD_09;//第五行，第一个8字
//10101010	
//-----------------------------------------------------------------------------
void ClearDisplay(void)
{	LCD_00.DATA = 0x00;
	LCD_01.DATA = 0x00;
	LCD_02.DATA = 0x00;
	LCD_03.DATA = 0x00;
	LCD_04.DATA = 0x00;
	LCD_05.DATA = 0x00;
	LCD_06.DATA = 0x00;
	LCD_07.DATA = 0x00;
	LCD_08.DATA = 0x00;
}
//-----------------------------------------------------------------------------
void ClearBitDisplay(void)
{
	LCD_00.DATA &= 0x1D;	//0001 1011
	LCD_00.BIT.BIT_3 = EQUAL_L;//水暖图标
	LCD_01.BIT.BIT_4 = EQUAL_L;//Hz 图标
	LCD_02.BIT.BIT_4 = EQUAL_L;//第3位 下点
	LCD_03.BIT.BIT_1 = EQUAL_L;//第2位 下点
	LCD_03.BIT.BIT_2 = EQUAL_L;//秒点
	LCD_03.BIT.BIT_4 = EQUAL_L;//第3位 上点
	LCD_06.BIT.BIT_4 = EQUAL_L;//设置 图标
	LCD_09.BIT.BIT_4 = EQUAL_L;//海拔高度
	

}
